app/controllers/user_profiles_controller.rb

  def index
    @user_profiles = UserProfile.all
---
SELECT "user_profiles".* FROM "user_profiles"

  def edit
    @user_profile = UserProfile.find(current_user.id)
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user_profile = UserProfile.new(user_profile_params)

    respond_to do |format|
      if @user_profile.save
---
INSERT INTO "user_profiles" ("name", "birthday", "address", "introduce", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @user_profile.update(user_profile_params)
---
UPDATE "user_profiles" SET "address" = $1, "updated_at" = $2 WHERE "user_profiles"."id" = $3  [["address", "東京都"], ["updated_at", "2019-02-11 13:54:53.940471"], ["id", 1]]

    def set_user_profile
      @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]